#ifndef __HC05_H
#define __HC05_H	 
#include "sys.h" 
//////////////////////////////////////////////////////////////////////////////////	 
//本程序只供学习使用，未经作者许可，不得用于其它任何用途
//ALIENTEK STM32F407开发板
//ATK-HC05蓝牙模块驱动代码	   
//正点原子@ALIENTEK
//技术论坛:www.openedv.com
//修改日期:2014/10/26
//版本：V1.0
//版权所有，盗版必究。
//Copyright(C) 广州市星翼电子科技有限公司 2014-2024
//All rights reserved									  
//********************************************************************************
//无修改信息							  
////////////////////////////////////////////////////////////////////////////////// 	   

#define HC05_KEY  	PFout(3) 	//蓝牙控制KEY信号
#define HC05_LED  	PCin(0)		//蓝牙连接状态信号
  
u8 HC05_Init(void);
#endif  
















